# Taps
tap "koekeishiya/formulae"
tap "felixkratz/formulae"
tap "joncrangle/tap"

# Formulae
brew "age"
brew "aria2"
brew "bash"
brew "bat"
brew "btop"
brew "cmake"
brew "coreutils"
brew "create-dmg"
brew "curl"
brew "docker"
brew "eza"
brew "fastfetch"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "glow"
brew "go"
brew "gradle"
brew "imagemagick"
brew "jenv"
brew "lazygit"
brew "llvm"
brew "lua"
brew "luarocks"
brew "maven"
brew "mole"
brew "neovim"
brew "nowplaying-cli"
brew "node"
brew "oh-my-posh"
brew "pkgconf"
brew "pipx"
brew "pipx"
brew "pixi"
brew "prettier"
brew "proto"
brew "python@3.14"
brew "ruff"
brew "rust"
brew "scc"
brew "sshpass"
brew "tailscale"
brew "tmux"
brew "trash"
brew "tree"
brew "unar"
brew "uv"
brew "wget"
brew "z3"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Window management
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"

# Status bar
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"
brew "joncrangle/tap/sketchybar-system-stats"

# Casks
cask "alt-tab"
cask "claude"
cask "claude-code"
cask "copilot-cli"
cask "docker-desktop"
cask "font-sf-mono"
cask "font-sf-pro"
cask "font-sketchybar-app-font"
cask "ghostty"
cask "helium-browser"
cask "iina"
cask "intellij-idea"
cask "mos"
cask "music-presence"
cask "notion"
cask "obsidian"
cask "prismlauncher"
cask "raycast"
cask "scroll-reverser"
cask "sf-symbols"
cask "t3-code"
cask "utm"
cask "vesktop"
cask "visual-studio-code"
cask "vlc"
cask "vnc-viewer"
cask "zed"

# go tools
go "github.com/packwiz/packwiz"
go "mvdan.cc/sh/v3/cmd/shfmt"
