# -------------------- Taps --------------------
tap "felixkratz/formulae"
tap "nikitabobko/tap"
tap "olets/tap"

# -------------------- Homebrew Formulae --------------------
brew "bash"
brew "bat"
brew "btop"
brew "coreutils"
brew "create-dmg"
brew "curl"
brew "docker"
brew "eza"
brew "fastfetch"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "go"
brew "gradle"
brew "imagemagick"
brew "jenv"
brew "lazygit"
brew "lua"
brew "luarocks"
brew "macmon"
brew "maven"
brew "media-control"
brew "neovim"
brew "nowplaying-cli"
brew "node"
brew "proto"
brew "prettier"
brew "python@3.14"
brew "pipx"
brew "ruff"
brew "scc"
brew "starship"
brew "switchaudio-osx"
brew "tmux"
brew "tree"
brew "trash"
brew "wget"
brew "zoxide"
brew "zsh-syntax-highlighting"
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"

# -------------------- Homebrew Casks --------------------
cask "aerospace"
cask "balenaetcher"
cask "battery"
cask "chatgpt"
cask "claude"
cask "claude-code"
cask "docker-desktop"
cask "font-sf-mono"
cask "font-sf-pro"
cask "font-sketchybar-app-font"
cask "ghostty"
cask "gstreamer-runtime"
cask "iina"
cask "intellij-idea"
cask "istat-menus"
cask "itsycal"
cask "firefox"
cask "mos"
cask "obsidian"
cask "raycast"
cask "sf-symbols"
cask "vesktop"
cask "visual-studio-code"
cask "vlc"
cask "vnc-viewer"

# -------------------- VS Code Extensions --------------------
vscode "13xforever.language-x86-64-assembly"
vscode "aaronthomas.vscode-snazzy-operator"
vscode "alfish.godot-files"
vscode "basdp.language-gas-x86"
vscode "beryxz.rtorrent-rc-helper"
vscode "bierner.lit-html"
vscode "boyswan.glsl-literal"
vscode "bradlc.vscode-tailwindcss"
vscode "codezombiech.gitignore"
vscode "colton.inline-html"
vscode "compulim.vscode-clock"
vscode "dbaeumer.vscode-eslint"
vscode "devkir.elixir-syntax-vscode"
vscode "docker.docker"
vscode "dotjoshjohnson.xml"
vscode "dsznajder.es7-react-js-snippets"
vscode "dtsvet.vscode-wasm"
vscode "dustypomerleau.rust-syntax"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "ev3dev.ev3dev-browser"
vscode "fabiospampinato.vscode-todo-plus"
vscode "formulahendry.auto-rename-tag"
vscode "fredrikbakke.agda-syntax"
vscode "geequlim.godot-tools"
vscode "geforcelegend.vscode-glsl"
vscode "gimly81.fortran"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "guyskk.language-cython"
vscode "hars.cppsnippets"
vscode "idleberg.applescript"
vscode "idleberg.jxa"
vscode "jakebathman.mysql-syntax"
vscode "jeff-hykin.better-c-syntax"
vscode "jeff-hykin.better-cpp-syntax"
vscode "jeff-hykin.better-csv-syntax"
vscode "jeff-hykin.better-dockerfile-syntax"
vscode "jeff-hykin.better-go-syntax"
vscode "jeff-hykin.better-js-syntax"
vscode "jeff-hykin.better-lisp-syntax"
vscode "jeff-hykin.better-objc-syntax"
vscode "jeff-hykin.better-objcpp-syntax"
vscode "jeff-hykin.better-perl-syntax"
vscode "jeff-hykin.better-prolog-syntax"
vscode "jeff-hykin.better-shellscript-syntax"
vscode "jeff-hykin.better-syntax"
vscode "jep-a.lua-plus"
vscode "jnoortheen.nix-ide"
vscode "johnnymorganz.luau-lsp"
vscode "jonwolfe.language-polymer"
vscode "josemurilloc.aura-spirit-dracula"
vscode "jsynowiec.vscode-insertdatestring"
vscode "justusadam.language-haskell"
vscode "karunamurti.haml"
vscode "kennethceyer.io"
vscode "kleber-swf.unity-code-snippets"
vscode "lauren.react-pack"
vscode "ldez.ignore-files"
vscode "lego-education.ev3-micropython"
vscode "liviuschera.noctis"
vscode "mads-hartmann.bash-ide-vscode"
vscode "magicstack.magicpython"
vscode "malmaud.tmux"
vscode "manishsencha.readme-preview"
vscode "mariomatheu.syntax-project-pbxproj"
vscode "mathiasfrohlich.kotlin"
vscode "mattn.lisp"
vscode "mechatroner.rainbow-csv"
vscode "minecraftcommands.syntax-mcfunction"
vscode "motivesoft.vscode-man-page-syntax"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.mono-debug"
vscode "msjsdiag.vscode-react-native"
vscode "naco-siren.gradle-language"
vscode "neikeq.godot-csharp-vscode"
vscode "nerudevs.jellyfish-dark"
vscode "openai.chatgpt"
vscode "oscarcs.dart-syntax-highlighting-only"
vscode "patbenatar.advanced-new-file"
vscode "pixl-garden.bongocat"
vscode "pkief.material-icon-theme"
vscode "pmndrs.pmndrs"
vscode "pomdtr.excalidraw-editor"
vscode "radium-v.better-less"
vscode "rebornix.prolog"
vscode "redcmd.tmlanguage-syntax-highlighter"
vscode "redhat.java"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "sainnhe.gruvbox-material"
vscode "scala-lang.scala"
vscode "se-dev-pion.code-block-folder"
vscode "shopify.ruby-lsp"
vscode "sidneys1.gitconfig"
vscode "slevesque.shader"
vscode "spgoding.datapack-language-server"
vscode "subframe7536.custom-ui-style"
vscode "sumneko.lua"
vscode "syler.sass-indented"
vscode "t3dotgg.vsc-material-theme-but-i-wont-sue-you"
vscode "takumii.markdowntable"
vscode "tamasfe.even-better-toml"
vscode "theamallalgi.frozen-embers"
vscode "toasty-technologies.octave"
vscode "tomoki1207.pdf"
vscode "tyriar.lorem-ipsum"
vscode "usernamehw.errorlens"
vscode "vintharas.learn-vim"
vscode "visualstudiotoolsforunity.vstuc"
vscode "vizora.gruvboxer"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-java-upgrade"
vscode "vscjava.vscode-maven"
vscode "xaver.clang-format"
vscode "youssef.viow"
vscode "yuce.erlang-otp"
vscode "yutengjing.better-colorizer"
vscode "zarifprogrammer.tailwind-snippets"
vscode "zhuangtongfa.material-theme"
vscode "zxh404.vscode-proto3"

# -------------------- Go Tools --------------------
go "github.com/packwiz/packwiz"
go "mvdan.cc/sh/v3/cmd/shfmt"

# -------------------- Cargo Tools --------------------
cargo "darklua"
cargo "nucleus"
cargo "pokeget"
cargo "tree-sitter-cli"
