return {
    {
        "folke/snacks.nvim",
        priority = 1000,
        lazy = false,
        opts = {
            dashboard = {
                preset = {
                    header = table.concat({
                        "███╗   ██╗███████╗██╗  ██╗ ██████╗ ██╗   ██╗██╗███╗   ███╗",
                        "████╗  ██║██╔════╝██║ ██╔╝██╔═══██╗██║   ██║██║████╗ ████║",
                        "██╔██╗ ██║█████╗  █████╔╝ ██║   ██║██║   ██║██║██╔████╔██║",
                        "██║╚██╗██║██╔══╝  ██╔═██╗ ██║   ██║╚██╗ ██╔╝██║██║╚██╔╝██║",
                        "██║ ╚████║███████╗██║  ██╗╚██████╔╝ ╚████╔╝ ██║██║ ╚═╝ ██║",
                        "╚═╝  ╚═══╝╚══════╝╚═╝  ╚═╝ ╚═════╝   ╚═══╝  ╚═╝╚═╝     ╚═╝",
                    }, "\n"),
                    keys = {
                        { key = "f", desc = "Find File",    action = ":Telescope find_files" },
                        { key = "r", desc = "Recent Files", action = ":Telescope oldfiles" },
                        { key = "g", desc = "Grep Text",    action = ":Telescope live_grep" },
                        { key = "n", desc = "New File",     action = ":ene | startinsert" },
                        { key = "l", desc = "Lazy",         action = ":Lazy" },
                        { key = "q", desc = "Quit",         action = ":qa" },
                    },
                },
                sections = {
                    { section = "header" },
                    { section = "keys",   gap = 1, padding = 1 },
                    { section = "startup" },
                },
            },
        },
    },
}
